; domain
(define (domain gripper-strips)
 (:requirements :strips :typing :constraints) 
 (:types type_1 object type_3 type_2)
 (:predicates (pred_3 ?v2 - type_3 ?v8 - type_1)
 	      (pred_2 ?v6 - object ?v8 - type_1)
	      (pred_4 ?v2 - type_3 ?v7 - type_2)
	      (pred_1 ?v2 - type_3 ?v6 - object ?v7 - type_2))

   (:action op_1
       :parameters  (?v2 - type_3 ?v4 ?v3 - type_1)
       :precondition (and  (pred_3 ?v2 ?v4))
       :effect (and  (pred_3 ?v2 ?v3)
		     (not (pred_3 ?v2 ?v4))))

   (:action op_3
       :parameters (?v2 - type_3 ?v5 - object ?v1 - type_1 ?v7 - type_2)
       :precondition  (and  (pred_2 ?v5 ?v1) (pred_3 ?v2 ?v1) (pred_4 ?v2 ?v7))
       :effect (and (pred_1 ?v2 ?v5 ?v7)
		    (not (pred_2 ?v5 ?v1)) 
		    (not (pred_4 ?v2 ?v7))))

   (:action op_2
       :parameters (?v2 - type_3 ?v5 - object ?v1 - type_1 ?v7 - type_2)
       :precondition  (and  (pred_1 ?v2 ?v5 ?v7) (pred_3 ?v2 ?v1))
       :effect (and (pred_2 ?v5 ?v1)
		    (pred_4 ?v2 ?v7)
		    (not (pred_1 ?v2 ?v5 ?v7)))))

; problem
(define (problem gripper-2-4-3)
(:domain gripper-strips)
(:objects obj_09 obj_08 - type_3
obj_11 obj_06 obj_13 obj_02 - type_2
obj_12 obj_05 obj_10 obj_04 - type_1
obj_03 obj_01 obj_07 - object)
(:init
(pred_3 obj_09 obj_12)
(pred_4 obj_09 obj_11)
(pred_4 obj_09 obj_06)
(pred_3 obj_08 obj_12)
(pred_4 obj_08 obj_13)
(pred_4 obj_08 obj_02)
(pred_2 obj_03 obj_10)
(pred_2 obj_01 obj_04)
(pred_2 obj_07 obj_05)
)
(:goal
(and
(pred_2 obj_03 obj_05)
(pred_2 obj_01 obj_10)
(pred_2 obj_07 obj_10)
)
)

(:constraints
  (always (not (pred_3 obj_09 obj_10)))
)
)

; plan
1. (op_1 obj_09 obj_12 obj_05)
   deleted: (pred_3 obj_09 obj_12)
   added: (pred_3 obj_09 obj_05)
   goals met: 0 of 3
2. (op_1 obj_08 obj_12 obj_04)
   deleted: (pred_3 obj_08 obj_12)
   added: (pred_3 obj_08 obj_04)
   goals met: 0 of 3
3. (op_3 obj_08 obj_01 obj_04 obj_02)
   deleted: (pred_2 obj_01 obj_04) (pred_4 obj_08 obj_02)
   added: (pred_1 obj_08 obj_01 obj_02)
   goals met: 0 of 3
4. (op_3 obj_09 obj_07 obj_05 obj_06)
   deleted: (pred_2 obj_07 obj_05) (pred_4 obj_09 obj_06)
   added: (pred_1 obj_09 obj_07 obj_06)
   goals met: 0 of 3
5. (op_1 obj_08 obj_04 obj_10)
   deleted: (pred_3 obj_08 obj_04)
   added: (pred_3 obj_08 obj_10)
   goals met: 0 of 3
6. (op_2 obj_09 obj_07 obj_05 obj_06)
   deleted: (pred_1 obj_09 obj_07 obj_06)
   added: (pred_2 obj_07 obj_05) (pred_4 obj_09 obj_06)
   goals met: 0 of 3
7. (op_2 obj_08 obj_01 obj_10 obj_02)
   deleted: (pred_1 obj_08 obj_01 obj_02)
   added: (pred_2 obj_01 obj_10) (pred_4 obj_08 obj_02)
   goals met: 1 of 3
8. (op_3 obj_08 obj_03 obj_10 obj_02)
   deleted: (pred_2 obj_03 obj_10) (pred_4 obj_08 obj_02)
   added: (pred_1 obj_08 obj_03 obj_02)
   goals met: 1 of 3
9. (op_1 obj_08 obj_10 obj_05)
   deleted: (pred_3 obj_08 obj_10)
   added: (pred_3 obj_08 obj_05)
   goals met: 1 of 3
10. (op_2 obj_08 obj_03 obj_05 obj_02)
   deleted: (pred_1 obj_08 obj_03 obj_02)
   added: (pred_2 obj_03 obj_05) (pred_4 obj_08 obj_02)
   goals met: 2 of 3
11. (op_3 obj_08 obj_07 obj_05 obj_02)
   deleted: (pred_2 obj_07 obj_05) (pred_4 obj_08 obj_02)
   added: (pred_1 obj_08 obj_07 obj_02)
   goals met: 2 of 3
12. (op_1 obj_08 obj_05 obj_10)
   deleted: (pred_3 obj_08 obj_05)
   added: (pred_3 obj_08 obj_10)
   goals met: 2 of 3
13. (op_2 obj_08 obj_07 obj_10 obj_02)
   deleted: (pred_1 obj_08 obj_07 obj_02)
   added: (pred_2 obj_07 obj_10) (pred_4 obj_08 obj_02)
   goals met: 3 of 3
